str = """
Talk_2022.8.20 11:16-1.txt
저장한 날짜 : 2022. 8. 20. 오후 2:13



2022년 8월 14일 일요일
2022. 8. 14. 오후 11:00: 날아라 드론보드_김정현님이 들어왔습니다.
운영정책을 위반한 메시지로 신고 접수 시 카카오톡 이용에 제한이 있을 수 있습니다.
2022. 8. 14. 오후 11:07: 하이퍼버닝_김수빈님이 들어왔습니다.
2022. 8. 14. 오후 11:08: 록히도키_김성민님이 들어왔습니다.
2022. 8. 14. 오후 11:08: 지식정보처리연구회_김연진님이 들어왔습니다.
2022. 8. 14. 오후 11:09: 초심자의코딩_김동환님이 들어왔습니다.
2022. 8. 14. 오후 11:09: 초심자의코딩_김인찬님이 들어왔습니다.
2022. 8. 14. 오후 11:12: 시조새_장보현님이 들어왔습니다.
2022. 8. 14. 오후 11:24: Red hawk_이수민님이 들어왔습니다.
2022. 8. 14. 오후 11:26: 3 Lights_문광일님이 들어왔습니다.
2022. 8. 14. 오후 11:28, 3 Lights_문광일 : 안녕하세요
2022. 8. 14. 오후 11:31: 아밍_박희수님이 들어왔습니다.
2022. 8. 14. 오후 11:32: 바람이 분다_이유찬님이 들어왔습니다.
2022. 8. 14. 오후 11:34, 3 Lights_문광일 : 팀 별로 예약은 언제부터 가능한가요?
2022. 8. 14. 오후 11:35, staff_추세빈 : 참가팀 입장이 완료되면 공지 드리겠습니다.
2022. 8. 14. 오후 11:35: 뚝딱이_이승재님이 들어왔습니다.
2022. 8. 14. 오후 11:44: 슈팅스타_유승섭님이 들어왔습니다.
2022. 8. 14. 오후 11:44: 초심자의코딩_김인찬님이 나갔습니다.
2022. 8. 14. 오후 11:50: 독수리 3형제_김규환님이 들어왔습니다.
2022. 8. 14. 오후 11:52: Hello Tello_최재완님이 들어왔습니다.
2022. 8. 14. 오후 11:53: Hello Tello_최재완님이 나갔습니다.
2022. 8. 14. 오후 11:53: Hello Tello_최재완님이 들어왔습니다.

2022년 8월 15일 월요일
2022. 8. 15. 오전 12:02, 총괄팀장_김민유 : 오픈채팅에는 각 팀의 팀장만 '팀명_이름'으로 들어와주세요. 공지방은 참가자들의 채팅은 제한됩니다. 궁금한 점이 있으시면 질문방에서 질문해주세요. 또한 공지방의 채팅공지에 [연습시간 스케쥴 및 예약 안내] 공지가 있으니 확인 부탁드립니다.
2022. 8. 15. 오전 12:02, 총괄팀장_김민유 : 톡게시판 '공지': 오픈채팅에는 각 팀의 팀장만 '팀명_이름'으로 들어와주세요. 공지방은 참가자들의 채팅은 제한됩니다. 궁금한 점이 있으시면 질문방에서 질문해주세요. 또한 공지방의 채팅공지에 [연습시간 스케쥴 및 예약 안내] 공지가 있으니 확인 부탁드립니다.
2022. 8. 15. 오전 12:09: 다크스타_이경민님이 들어왔습니다.
2022. 8. 15. 오전 12:14: 사드론_오상준님이 들어왔습니다.
2022. 8. 15. 오전 12:18: CKJ_조용인님이 들어왔습니다.
2022. 8. 15. 오전 12:19: 멘토멘티마틴_봉성재님이 들어왔습니다.
2022. 8. 15. 오전 12:28: 세얼간이_류새인님이 들어왔습니다.
2022. 8. 15. 오전 1:06: Lucky2Marine_남상혁님이 들어왔습니다.
2022. 8. 15. 오전 1:23, 3 Lights_문광일 : 각 팀명을 적어서 예약 하면 되나요?
2022. 8. 15. 오전 1:23, 총괄팀장_김민유 : 넵, 맞습니다.
2022. 8. 15. 오전 1:23, 3 Lights_문광일 : 그리고 제가 사용법을 잘 몰라서 연습겸 임의의 글자 적고 지워볼려고 햇는데 아직은 오픈이 안돼서 수정이 안되는건가요? 
2022. 8. 15. 오전 1:23, 3 Lights_문광일 : 그 구글 스프레드시트 어플을 깔라고 나오더라구요
2022. 8. 15. 오전 1:24, 3 Lights_문광일 : 깔고 적어볼려고해도 같은 문구만 나오네요
2022. 8. 15. 오전 1:24, 총괄팀장_김민유 : 혹시 지금 시간이 늦어서, 제 오픈채팅으로 연락을 주실 수 있을까요?
2022. 8. 15. 오전 1:38: Quantum scenT_민향기님이 들어왔습니다.
2022. 8. 15. 오전 9:27: 사삼성넷_조선민님이 들어왔습니다.
2022. 8. 15. 오전 9:59, 슈팅스타_유승섭 : 재공지 중 내용 중 선착순 댓글 작성 시 3시간 모두 한 댓글로 신청하면 되는건가요?
2022. 8. 15. 오전 10:05, 총괄팀장_김민유 : 1부 16:00-16:15
2부 16:20-16:35
3부 16:40-16:55
추가신청 17:00-17:15

위와 같이 세번에 나누어 한시간씩 신청이 가능하며, 각 팀당 세시간은 반드시 보장됩니다. 이후 17시부터는 추가신청이 가능합니다.
2022. 8. 15. 오전 10:06, 아밍_박희수 : 해당 시간에 제가 연락이 어려울 것 같아 다른 팀원이 대신 신청해주기로 했는데 해당 팀원을 잠시 공지방에 초대해도 될까요? 
2022. 8. 15. 오전 10:08, 총괄팀장_김민유 : 넵, 대신 댓글은 팀당 한분만 작성이 가능하다는 점만 유의해주세요.
2022. 8. 15. 오전 10:11, 아밍_박희수 :  네! 감사합니다
2022. 8. 15. 오전 10:16: 3 Lights_이종혁님이 들어왔습니다.
2022. 8. 15. 오전 10:28, 3 Lights_문광일 : 질문이 있는데요, 

1. 기존 구글스프레드시트 방법에서는 요일 별로 최대 네 팀에서 두 팀으로 제한하는 특정 날이 있었는데, 그것은 그대로 유지가 되는건가요? 

2. 시간 기준이 애매한데 안드로이드 폰과 아이폰 등등 기종에 따라 16시가 되는 순간이 다를거같은데 이 부분에 대해서 명확하게 대처 방법이 있나요? 

3. 만약에 동일한 신청 시간에 최대 허용 팀이 초과하여 다른 팀이 신청하면 어떻게 처리되는건가요? 댓글이 빠르게 올라가면 자기가 중복하여 신청한 사실을 모를거같아서 질문 드립니다. 
2022. 8. 15. 오전 10:41, 총괄팀장_김민유 : 각 질문에 번호별로 대답을 드리겠습니다.

1. 해당 사항은 유지됩니다. 

2. 대회 진행 자체를  학생들이 진행하기에 해당 부분의 정확성까지는 고려하기 힘든 점 사과드립니다. 하지만 카카오톡의 댓글에서는 같은 16시의 경우에 먼저 업로드 되는 순서가 눈에 명확하게 보이므로 이 순서로 우선권을 부여하고자 합니다.

3. 각각의 스태프들이 실시간으로 스프레드시트에 예약상황을 업로드 할 뿐만 아니라 댓글에서 중복되는 팀은 확인하여 전달할 생각입니다.
2022. 8. 15. 오전 10:44, 3 Lights_문광일 : 네 감사합니다!
2022. 8. 15. 오전 11:08: 복싱하는코끼리_이건규님이 들어왔습니다.
2022. 8. 15. 오전 11:14: Lokeheedrone_길지윤님이 들어왔습니다.
2022. 8. 15. 오전 11:47: 이미 비자 발급함_김은진님이 들어왔습니다.
2022. 8. 15. 오전 11:52, 총괄팀장_김민유 : 오픈채팅에는 각 팀의 팀장만 '팀명_이름'으로 들어와주세요. 공지방은 참가자들의 채팅은 제한됩니다. 궁금한 점이 있으시면 질문방에서 질문해주세요. 또한 공지방의 채팅공지에 [연습시간 스케쥴 및 예약 안내] 공지가 있으니 확인 부탁드립니다. 

그리고 해당 공지에 댓글로 이전의 질문들을 정리하였으니 늦게 들어오신 분들은 확인바랍니다.
2022. 8. 15. 오전 11:52, 총괄팀장_김민유 : 톡게시판 '공지': 오픈채팅에는 각 팀의 팀장만 '팀명_이름'으로 들어와주세요. 공지방은 참가자들의 채팅은 제한됩니다. 궁금한 점이 있으시면 질문방에서 질문해주세요. 또한 공지방의 채팅공지에 [연습시간 스케쥴 및 예약 안내] 공지가 있으니 확인 부탁드립니다. 

그리고 해당 공지에 댓글로 이전의 질문들을 정리하였으니 늦게 들어오신 분들은 확인바랍니다.
2022. 8. 15. 오전 11:55, Red hawk_이수민 : 혹시 1차 예선때 사용할 QR 마커의 종류는 어떤 종류(Ex. Aruco marker)인지 알 수 있을까요?
2022. 8. 15. 오후 12:00: 나민정_최나린님이 들어왔습니다.
2022. 8. 15. 오후 12:02: 드로잉_권현준님이 들어왔습니다.
2022. 8. 15. 오후 12:03: 에어콘_신현우님이 들어왔습니다.
2022. 8. 15. 오후 12:05: DTS_박재욱님이 들어왔습니다.
2022. 8. 15. 오후 12:07, Staff_강민주 : 참가팀 입장이 모두 완료되면 1차미션과 OT Q&A 파일이 업로드 될 예정입니다. 해당 파일에 QR 코드 및 미션 맵 예시사진이 들어있으니 확인하시면 될 것 같습니다
2022. 8. 15. 오후 12:10, Red hawk_이수민 : 네 감사합니다
2022. 8. 15. 오후 12:10: 날아오르조_황주원님이 들어왔습니다.
2022. 8. 15. 오후 12:10: 짱준용주_김창준님이 들어왔습니다.
2022. 8. 15. 오후 12:10: 짱준용주_김창준님이 나갔습니다.
2022. 8. 15. 오후 12:11: 짱준용주_김창준님이 들어왔습니다.
2022. 8. 15. 오후 12:11: 비상착륙_하미준님이 들어왔습니다.
2022. 8. 15. 오후 12:13, 이미 비자 발급함_김은진 : 연습시간을 신청할때 같은날을 한시간씩 두번 신청해서 연속 2시간으로 잡아도 되는건가요?
2022. 8. 15. 오후 12:16, Quantum scenT_민향기 : 팀원 한 명이 개인 일정으로 인해 1차 예선 참여 가능 여부가 확실치 않은데 모든 팀원이 참석해야하는지 궁금합니다. 
2022. 8. 15. 오후 12:17: 숭숭이_이진님이 들어왔습니다.
2022. 8. 15. 오후 12:17: HSS_하성훈님이 들어왔습니다.
2022. 8. 15. 오후 12:20, Staff_강민주 : 가능은 하시지만 공지방 공지글을 보시면 팀별로 할당된 세시간을 각각 1부, 2부, 3부에 나눠서 선착순 신청받고 있습니다. 만약 하시려는 시간이 1부에 다 마감되면 연속 두시간을 배정하진 못할 것 같습니다.
2022. 8. 15. 오후 12:21, Staff_강민주 : 모든팀원이 참여하실 필욘 없습니다! 일정이 가능한 팀원만 참석하셔도 좋습니다.
2022. 8. 15. 오후 12:22, Quantum scenT_민향기 : 감사합니다:)
2022. 8. 15. 오후 12:25: 코딩 못하는 삼총사_허승진님이 들어왔습니다.
2022. 8. 15. 오후 12:26, 드로잉_권현준 : 연습시간때 tello edu 드론만 제공되나요, 아니면 1차예선에서 사용할 6각기둥이 비치되어있나요?
2022. 8. 15. 오후 12:26: 도원결의_김관우님이 들어왔습니다.
2022. 8. 15. 오후 12:27, Staff_강민주 : 1차예선과 환경과 동일하게 제공됩니다
2022. 8. 15. 오후 12:28, 드로잉_권현준 : 감사합니다~..
2022. 8. 15. 오후 12:29, Red hawk_이수민 : 혹시 마커 위치도 동일하다는 건가요? 아니면 마커 위치는 예선 당일 변경 될 수 있는건가요?
2022. 8. 15. 오후 12:29, HSS_하성훈 : OT때 사용했던 ppt는 따로 제공을 안해주시는건가요?
2022. 8. 15. 오후 12:31, Staff_강민주 : 마커 위치는 예선당일 변경될 수 있습니다
2022. 8. 15. 오후 12:33, Staff_강민주 : ppt는 따로 제공하지 않고 공지방에 모든 팀이 입장 완료되면 미션설명과 OT QnA그리고 메뉴얼이 제공될 예정입니다
2022. 8. 15. 오후 12:39: MARTINIES_유연정님이 들어왔습니다.
2022. 8. 15. 오후 12:44: MARTINIES_이주환님이 들어왔습니다.
2022. 8. 15. 오후 12:47, 드로잉_권현준 : 파란색 or 초록색을 detection 하라고 되있는데요. 벽면에 파란색 초록색 둘다 붙어있는건가요 아니면 둘둥하나만 붙어있는건가요.??
2022. 8. 15. 오후 12:51, 아밍_박희수 : 1차 예선에서 마커 detection의 기준이 궁금합니다! 영상에 마커중 일부분만 촬영이 되었고 이것을 detection해도 인정이 될까요? 아니면 마커 전체 모양이 나오도록 되어야지만 인정이 되는 건가요?
2022. 8. 15. 오후 12:52: MARTINIES_이주환님이 나갔습니다.
2022. 8. 15. 오후 1:01, 바람이 분다_이유찬 : 예선 진행시간 30분내에 드론 비행을 중단하고 코드수정하는 것이 가능한가요?
2022. 8. 15. 오후 1:04, Staff_강민주 : 실제 미션에는 파란색과 초록색중 하나만 부착되어있을겁니다. 미션 파일에 있는 사진은 단순 예시일 뿐입니다
2022. 8. 15. 오후 1:04, 드로잉_권현준 : 감사합니다
2022. 8. 15. 오후 1:05, Staff_강민주 : 일부가 아닌 전체가 감지되어야 인식이라고 인정됩니다.
2022. 8. 15. 오후 1:09, Staff_강민주 : 제한시간 30분 내에 코드 수정 가능합니다. 다만 비행중 코드를 실시간으로 수정하여 ‘조종’을 하는 행위는 금지합니다. 비행 후 문제를 인식하고 착륙한뒤, 코드 수정후 다시 비행하는것은 가능하지만, 미션 수행을 완료한 팀을 다시 변별하기 위해 미션 수행 시간을 측정하므로 그에 따른 불이익이 있을 수 있습니다.
2022. 8. 15. 오후 1:13, 록히도키_김성민 : 미션 수행 중 수정이 가능하면 초록색이나 파란색중 무엇인지 확인 후 그에 맞게 코드를 수정하여 미션을 수행하는 상황이 발생할 수 있습니다. 코드를 확인한다면 상관없겠지만 40팀의 코드 전체를 확인하기에는 어려움이 있다고 보는데 이러한 경우에 대한 제한이 어떤 방식으로 있을까요?
2022. 8. 15. 오후 1:23, Staff_강민주 : 미션이 완료된 후 미션 코드를 이메일로 받아 심사할 예정입니다. 코드는 점수에 들어가진 않지만 해당 부정행위에 대한 확인용이므로 크게 부담갖지 않으셔도 될 것 같습니다.
2022. 8. 15. 오후 1:24, 록히도키_김성민 : 넵 감사합니다
2022. 8. 15. 오후 1:38, Red hawk_이수민 : 1차 예선 안내에 있는 QR 코드 이미지를 보면 open cv 에서 사용하는 영상처리 QR marker는 아닌것 같고 그냥 모델2 QR 같은데 이렇게 알고 진행하면 되나요?
2022. 8. 15. 오후 2:00: 소민아 뭐하니_성소민님이 들어왔습니다.
2022. 8. 15. 오후 2:08, CKJ_조용인 : 세시간은 반드시 보장됩니다. 이후 17시 부터는 추가신청이 가능합니다 -> 이 말이 최대 4시간까지 신청 가능하단 말인지 아니면 3부까지 3시간 확보하지 못한팀이 추가 신청하는 기간인지 궁금합니다
2022. 8. 15. 오후 2:09, Staff_강민주 : Open cv로도 qr마커 인식 됩니다
2022. 8. 15. 오후 2:11, Staff_강민주 : 팀별 세시간은 무조건 보장되는 시간입니다. 따라서 17시 이후로는 배정된 세시간을 신청하는 것이 아닌 남는 시간에 대해 팀당 추가시간을 선착순으로 배정합니다.
2022. 8. 15. 오후 2:20, Red hawk_이수민 : 네, 그 말씀하신 qr 마커의 종류가 뭔지 알고싶습니다. 다시 말하면 Open cv로 인식할 수 있는지 여부가 아니고 대회에 사용되는 QR종류를 여쭤보고 싶습니다.
2022. 8. 15. 오후 2:24, 총괄팀장_김민유 : 넵, 아까 말씀하셨던 모델2 큐얼이 맞습니다. 문자열이 내장되어 있는 큐얼을 인식하면 될 것 같습니다.
2022. 8. 15. 오후 2:24, Red hawk_이수민 : 네 알겠습니다
2022. 8. 15. 오후 3:30: 숭숭이_이예찬님이 들어왔습니다.
2022. 8. 15. 오후 3:33: 숭숭이_이예찬님이 나갔습니다.
2022. 8. 15. 오후 3:38, CKJ_조용인 : 선착순 신청을 재공지 게시글에 올려야하나요 아니면 15시 전에 올라왔던 연습기간 스케줄 및 예약 선착순 신청에 올려야하나요?
2022. 8. 15. 오후 3:39, 이미 비자 발급함_김은진 : 늦게 들어와서 연습시간 스케줄 및 예약 선착순 신청 공지가 보이지 않는데 다시 올려주실 수 있나요?
2022. 8. 15. 오후 3:43, 총괄팀장_김민유 : 연습 예약_1부 공지를 새로 업로드하였습니다. 각 1부,2부, 3부 공지를 업로드해드릴테니 댓글에 있는 예시처럼 댓글을 달면 됩니다.
2022. 8. 15. 오후 3:43, 총괄팀장_김민유 : 재업로드하였습니다.
2022. 8. 15. 오후 3:54: Hison father_김영륜님이 들어왔습니다.
2022. 8. 15. 오후 3:55: staff_진선영님이 들어왔습니다.
2022. 8. 15. 오후 3:55: Staff 안지연님이 들어왔습니다.
2022. 8. 15. 오후 3:56: 3 Lights_김주혁님이 들어왔습니다.
2022. 8. 15. 오후 4:01: 록히드 야놀자_홍지승님이 들어왔습니다.
2022. 8. 15. 오후 4:01, 총괄팀장_김민유 : 두개의 날짜를 올린 팀은 첫번째 시간만 인정합니다.
2022. 8. 15. 오후 4:01, Staff_강민주 : Lockheedrone팀 한번에 한타임만 입력가능합니다
2022. 8. 15. 오후 4:02, Staff_강민주 : 록히드 야놀자팀 한번에 한타임만 입력 가능합니다
2022. 8. 15. 오후 4:06, staff_진선영 : 날아라 드론보드팀 한번에 한 타임만 입력 가능합니다
2022. 8. 15. 오후 4:07, Staff_강민주 : 소민아 뭐하니팀 22일 2번과 1번, 18일 3번 신청하셨는데 한번에 한타임만 신청가능합니다. 앞에것만 인정하겠습니다
2022. 8. 15. 오후 4:08, 초심자의코딩_김동환 : 안내공지에서 2번 항목에는 팀장 이름을, 4번 항목에서는 팀명 이름을 양식으로 지정해주셨는데 팀명으로 입력하면 될까요?
2022. 8. 15. 오후 4:09, staff_추세빈 : 팀명으로 입력해주세요
2022. 8. 15. 오후 4:09, Staff_강민주 : 넵 팀이름으로 신청하시면 되고, 1부, 2부, 3부 각각 한타임씩 신청가능합니다
2022. 8. 15. 오후 4:09, 총괄팀장_김민유 : 다시 한번더 공지합니다. 한 부에는 하나의 시간만 신청가능합니다. 여러 시간대를 올리신 팀은 첫번째로 올린 것으로 인정하고, 한번에 여러시간을 같이 올린팀은 먼저 있는 시간으로만 인정합니다.
2022. 8. 15. 오후 4:10, 나민정_최나린 : 확정된 시간은 댓글보고 확인하나요? 아니면 추가로 확정 시간대 공지를 올려주시나요?
2022. 8. 15. 오후 4:10, 총괄팀장_김민유 : 1부 예약을 한 내용을 정리 중입니다. 스태프들이 확인이 끝나고 바로 업로드해드리겠습니다.
2022. 8. 15. 오후 4:11: 아밍_이상현님이 들어왔습니다.
2022. 8. 15. 오후 4:12, 초심자의코딩_김동환 : 구글독스 시트에 하이픈 입력된 팀은 확인된 팀인가요?
2022. 8. 15. 오후 4:14, Red hawk_이수민 : 시간을 10시 - 11시 로 적은 팀은 인정 되는건가요 안되는 건가요?
2022. 8. 15. 오후 4:17, Staff_강민주 : 2부부터는 인정되지 않습니다
2022. 8. 15. 오후 4:17, staff_추세빈 : 1부까지만 인정하겠습니다.
2부 신청부터는 반드시 '하나의' 연습시간과 시간이 아닌 시간 '번호'를 정확하게 기재해주시길 바랍니다. 
2022. 8. 15. 오후 4:18, MARTINIES_유연정 : 2부 4시 20분 시작맞나요?
2022. 8. 15. 오후 4:18, 총괄팀장_김민유 : 먼저, 정리가 늦어지고 있기에, 30분부터 2부예약을 받도록 하겠습니다. 혼란을 드려서 죄송합니다. 정리는 완료되는대로 바로 보내드리도록 하겠습니다.
2022. 8. 15. 오후 4:18, 초심자의코딩_김동환 : 20분까지 1분 남았는데 2부 예약공지 띄워주셔야할 것 같습니다
2022. 8. 15. 오후 4:18, 초심자의코딩_김동환 : 확인했습니다
2022. 8. 15. 오후 4:19, MARTINIES_유연정 : 확인했습니다!
2022. 8. 15. 오후 4:25, 짱준용주_김창준 : 4팀까진 겹쳐도 되는건가요?
2022. 8. 15. 오후 4:26, Staff_강민주 : 삭제된 메시지입니다. 
2022. 8. 15. 오후 4:26, 코딩 못하는 삼총사_허승진 : 모바일 상으로는 안보이는 오류가 있기도 한가요?
2022. 8. 15. 오후 4:27, 코딩 못하는 삼총사_허승진 : 사진
2022. 8. 15. 오후 4:28, staff_추세빈 : 구글 시트의 비어있는 시간은 모두 가능하다고 보시면 됩니다
2022. 8. 15. 오후 4:29, staff_추세빈 : 어떤 오류를 말씀하시는 건지 자세하게 말씀해주실 수 있을까요?
2022. 8. 15. 오후 4:30, 코딩 못하는 삼총사_허승진 : 1부 예약에서 22일 8에 신청했는데 이름이 안보입니다
2022. 8. 15. 오후 4:31, staff_추세빈 : 확인해보겠습니다
2022. 8. 15. 오후 4:31, 코딩 못하는 삼총사_허승진 : 아 방금 추가하신거 같네요 확인했습니다
2022. 8. 15. 오후 4:31, staff_추세빈 :  넵
2022. 8. 15. 오후 4:32, 초심자의코딩_김동환 : 22일 7번에 저희 팀이 중복 입력된 것 같습니다. 수정 부탁드립니다.
2022. 8. 15. 오후 4:32, staff_추세빈 : 네 감사합니다 수정 완료했습니다!
2022. 8. 15. 오후 4:32, DTS_박재욱 : 3부 시작시간이 궁금합니다.
2022. 8. 15. 오후 4:35, Staff_강민주 : 이거 하려고 휴학도 포기했다팀 22일 5번이 마감되어 다른시간으로 신청 부탁드립니다
2022. 8. 15. 오후 4:35, Staff_강민주 : 숭숭이 뚝딱이팀 22일 7번이 마감되어 다른시간으로 신청 부탁드립니다
2022. 8. 15. 오후 4:36, Staff_강민주 : 지식정보처리연구회팀 22일 5번이 신청마감되어 다른시간으로 신청 부탁드립니다
2022. 8. 15. 오후 4:36, DTS_박재욱 : DTS팀 18일 7번으로 신청했는데 8번에 중복입력이 되어있습니다.
2022. 8. 15. 오후 4:37, Staff_강민주 : Martinies팀 22일 4번이 마감되어 다른시간으로 신청 부탁드립니다
2022. 8. 15. 오후 4:38, 지식정보처리연구회_김연진 : 22일 3번으로 수정했습니다
2022. 8. 15. 오후 4:38, staff_진선영 : 확인했습니다!
2022. 8. 15. 오후 4:38, 총괄팀장_김민유 : 확인했습니다
2022. 8. 15. 오후 4:38, Staff_강민주 : 이거 하려고 휴학도 포기했다님 22일 3번이 마감되어 다른시간으로 신청 부탁드립니다
2022. 8. 15. 오후 4:38, staff_추세빈 : 현재 스태프들이 예약을 정리하고 있습니다. 예민한 사항일 수 있기 때문에 꼼꼼하게 확인하기 위해서 다소 시간이 걸리는 점 양해부탁드립니다 3부 시작 시간은 5시로 예정하고 있습니다. 정확한 시간을 재공지 해드리겠습니다.
2022. 8. 15. 오후 4:38, DTS_박재욱 : 네 알겠습니다.
2022. 8. 15. 오후 4:39, staff_추세빈 : 22일 신청은 마감되었습니다. 
2022. 8. 15. 오후 4:39, 총괄팀장_김민유 : 22일은 마감입니다.
2022. 8. 15. 오후 4:39, 날아라 드론보드_김정현 : 날아라 드론보드 팀 2부 예약 18일 4에서 8로 변경 요청드립니다
2022. 8. 15. 오후 4:41, staff_추세빈 : 네 변경했습니다. 변경 요청은 비어있는 시간에 한해서 받겠습니다. 다른 참가자 팀들에게도 혼돈을 주지 않기 위해서 정확한 시간을 기입해주세요!
2022. 8. 15. 오후 4:41, 날아라 드론보드_김정현 : 네 감사합니다
2022. 8. 15. 오후 4:53, 사드론_오상준 : 1부 신청을 못했는데 2부에 한번더 해도 될까요?
2022. 8. 15. 오후 4:54, 록히드 야놀자_홍지승 : 2부 이제야 작성해서 확인 부탁드립니다
2022. 8. 15. 오후 4:55, Red hawk_이수민 : 추가 연습시간 신청도 17:15 이후에 동일한 방식으로 진행되나요?
2022. 8. 15. 오후 4:56, staff_추세빈 : 공지에서 알려드린 바와 같이, 한 부에 두번 신청은 어렵습니다. 3부 신청이 끝나고 추가 신청 기간에 신청해주세요! 
2022. 8. 15. 오후 4:56, staff_추세빈 : 넵
2022. 8. 15. 오후 4:57, staff_추세빈 : 네 맞습니다. 시간은 재공지 해드리겠습니다. 아직 신청을 완료하지 못한 팀은 대기 부탁드립니다
2022. 8. 15. 오후 4:58, staff_추세빈 : hss, 록히드야놀자 팀 2부 신청 확인 결과 마감시간을 넘겨서 무효 처리하겠습니다. 3부에 재신청 바랍니다. 
2022. 8. 15. 오후 4:58, staff_추세빈 : @HSS_하성훈  @록히드 야놀자_홍지승 
2022. 8. 15. 오후 4:59, 록히드 야놀자_홍지승 : 그러면 3부 2시간 신청 가능한건가욮
2022. 8. 15. 오후 4:59, 록히드 야놀자_홍지승 : 아니면 똑같이1시간만 신청해야하나욮
2022. 8. 15. 오후 4:59, 록히드 야놀자_홍지승 : ??
2022. 8. 15. 오후 4:59, staff_추세빈 : 한 부에 한시간씩만 신청 가능합니다! 총 3시간 예약을 못한 팀은 추가 신청 시간에 예약해주세요
2022. 8. 15. 오후 4:59, 록히드 야놀자_홍지승 : 네
2022. 8. 15. 오후 4:59, staff_추세빈 : 1분 뒤에 3부 신청 시작합니다
2022. 8. 15. 오후 5:01, Staff_강민주 : 짱준용주팀 19일 3번 마감입니다 다른 시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:02, Staff_강민주 : Lucky2Marine팀 21일은 운영하고 있지 않습니다 날짜 다시 확인하고 신청부탁드립니다
2022. 8. 15. 오후 5:02, staff_진선영 : 뚝딱이팀 18일 4번 마감입니다 다른 시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:03, staff_진선영 : 숭숭이팀 18일 4번 마감입니다 다른 시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:03, staff_진선영 : 초심자의 코딩팀 18일 4번 마감입니다 다른 시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:03, Staff_강민주 : 드로잉팀 19일 3번 마감입니다 다른 시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:03, Staff_강민주 : 록히도키팀 19일 5번 마감입니다 다른시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:03, 초심자의코딩_김동환 : 초심자의코딩 17일 5번으로 하겠습니다.
2022. 8. 15. 오후 5:03, Staff_강민주 : 댓글로 적어주세요
2022. 8. 15. 오후 5:04, staff_진선영 : Red hawk팀 18일 4번 마감입니다 다른 시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:04, Staff_강민주 : 슈팅스타팀 19일 5번 마감입니다 다른시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:04, Staff_강민주 : 슈팅스타팀 19일 8번 마감입니다 다른시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:05, staff_진선영 : 록히드 야놀자팀 18일 3번 마감입니다 다른 시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:06, Staff_강민주 : Hison father팀 19일 4번 마감입니다 다른시간 신청 부탁드립니다
2022. 8. 15. 오후 5:07, Staff_강민주 : Lucky2Marine팀 19일 8번 마감입니다 다른시간 신청 부탁드립니다.
2022. 8. 15. 오후 5:07, Staff_강민주 : 현재 18,19,22는 마감입니다 다른시간으로 신청 부탁드립니다
2022. 8. 15. 오후 5:08, 초심자의코딩_김동환 : 초심자의코딩 5번에서 4번으로 수정해서 올렸습니다. 5번은 삭제 부탁드립니다.
2022. 8. 15. 오후 5:09, Lucky2Marine_남상혁 : 수정하여 댓글 작성하였씁니다.
2022. 8. 15. 오후 5:10, 총괄팀장_김민유 : 확인했습니다
2022. 8. 15. 오후 5:11, DTS_박재욱 : DTS(드론탄소년단), 16일, 8에서
DTS(드론탄소년단), 17일, 8로 변경 요청합니다.
2022. 8. 15. 오후 5:12, 총괄팀장_김민유 : 확인했습니다
2022. 8. 15. 오후 5:12, DTS_박재욱 : 감사합니다.
2022. 8. 15. 오후 5:12, 초심자의코딩_김동환 : 추가신청에서도 팀당 하루2시간 제한은 동일하게 적용되나요?
2022. 8. 15. 오후 5:13, 총괄팀장_김민유 : 아니요, 추가신청은 상관없습니다.
2022. 8. 15. 오후 5:13, 초심자의코딩_김동환 : 확인했습니다.
2022. 8. 15. 오후 5:14, DTS_박재욱 : 번거롭게 하여 죄송합니다.
DTS(드론탄소년단), 17일, 8에서
DTS(드론탄소년단), 17일, 4로 변경 가능할까요
2022. 8. 15. 오후 5:14, HSS_하성훈 : 지금 3부 진행중인데, 늦게 신청해서 2번밖에 신청을 못한 팀들은 그러면 다름 팀들 추가신청과 경쟁을 해야하는건가요?
2022. 8. 15. 오후 5:15, 총괄팀장_김민유 : 확인했습니다.
2022. 8. 15. 오후 5:15, DTS_박재욱 : 감사합니다!
2022. 8. 15. 오후 5:16, 록히드 야놀자_홍지승 : 늦게신청하여서 2시간밖에 신청 못한 팀도 추가시간때 1시간만 넣을수 있나요?
2022. 8. 15. 오후 5:16, HSS_하성훈 : 2번밖에 신청을 못한 팀들은 추가신청 할 때 2번 신청을 할 수 있을까요
2022. 8. 15. 오후 5:20, staff_추세빈 : 추가신청은 2번 신청이 가능합니다! 댓글로 예약할 시간 같이 작성해주세요
2022. 8. 15. 오후 5:22, HSS_하성훈 : 2번밖에 신청을 못한 팀들에게 남는 시간에 대한 우선권이 부여될까요?
2022. 8. 15. 오후 5:22, HSS_하성훈 : 추가신청이 아닌 3번째 신청에 한해서입니다.
2022. 8. 15. 오후 5:24, 이미 비자 발급함_김은진 : 이미 세번 신청한 팀도 해당이 되나요?
2022. 8. 15. 오후 5:25, 총괄팀장_김민유 : 2번밖에 신청을 하지못한 팀들은 28분에 미리 신청해주세요.
2022. 8. 15. 오후 5:25, HSS_하성훈 : 추가신청 댓글에다가 신청을 하면 될까요?
2022. 8. 15. 오후 5:26, 총괄팀장_김민유 : 이미 세번 신청한 팀은 추가신청에서 한번만 가능합니다.
2022. 8. 15. 오후 5:26, 총괄팀장_김민유 : 넵
2022. 8. 15. 오후 5:26, HSS_하성훈 : 감사합니다!
2022. 8. 15. 오후 5:27, 이미 비자 발급함_김은진 : 감사합니다
2022. 8. 15. 오후 5:31, HSS_하성훈 : HSS팀 3번째 신청 17일 6, 에서 밀렸는데, 17일 3으로 변경이 가능할까요? 3번째 신청입니다.
2022. 8. 15. 오후 5:31, HSS_하성훈 : 17일 5,에서 밀렸습니다.
2022. 8. 15. 오후 5:34, staff_진선영 : 넵 확인했습니다
2022. 8. 15. 오후 5:34, HSS_하성훈 : 감사합니다
2022. 8. 15. 오후 5:35, 짱준용주_김창준 : 17일 3 제가 먼저였는데 후에 변경 하신다고
2022. 8. 15. 오후 5:35, 짱준용주_김창준 : 먼저 예약을 빼는건 아니지 않나요..
2022. 8. 15. 오후 5:35, 이미 비자 발급함_김은진 : 이미 비자 발급함팀 16일 6으로 변경가능할까요
2022. 8. 15. 오후 5:36, 멘토멘티마틴_봉성재 : 멘토멘티마틴팀 17일 1로 변경 가능할까요?
2022. 8. 15. 오후 5:37, 이미 비자 발급함_김은진 : 추가신청이 다 차서 아직 자리가 남은 6으로 변경하고자합니다!
2022. 8. 15. 오후 5:38, 총괄팀장_김민유 : HSS 팀장님 저한테 개인톡으로 연락주세요 !
2022. 8. 15. 오후 6:37, 총괄팀장_김민유 : 소민아 뭐하니 팀장님 개인톡으로 저에게 연락주세요!
2022. 8. 15. 오후 7:22, 지식정보처리연구회_김연진 : 혹시 16일(화) 13-14시 장소 변경가능한지 궁금합니다
2022. 8. 15. 오후 7:34, 총괄팀장_김민유 : 변경했습니다. 확인부탁드립니다!
2022. 8. 15. 오후 7:35, 지식정보처리연구회_김연진 : 확인했습니다 감사합니다
2022. 8. 15. 오후 8:08, 아밍_박희수 : QnA 읽어보니까 본선에서 이미지 인식 관련해서 학습시킨 이미지를 주신다고 했는데 학습이 되어진 모델을 주시는 건가요? 아니면 학습시킬 이미지를 주시는 건가요?
2022. 8. 15. 오후 8:12, 총괄팀장_김민유 : 학습시킬 이미지를 제공합니다!
2022. 8. 15. 오후 8:13, 아밍_박희수 : 아하! 감사합니다:)
2022. 8. 15. 오후 10:25, CKJ_조용인 : 그러면 학습시킬 이미지 주신다고 하셨는데 이번 1차 예선 때 파란색,빨간색, QR 사각형 이렇게 3개 파일 주시는건가요? 주신다면 언제 주시나요?
2022. 8. 15. 오후 10:35, Staff_강민주 : 이미지 인식은 2차 예선내용입니다. 1차 예선에 합격하시면 드리겠습니다

2022년 8월 16일 화요일
2022. 8. 16. 오후 12:26, Red hawk_이수민 : 스태프님, 대회에 사용되는 드론 모델명이 정확히 어떻게 되는지 알 수 있을까요?
2022. 8. 16. 오후 12:28, 총괄팀장_김민유 : tello edu입니다.
2022. 8. 16. 오후 1:42: 이거 하려고 휴학반납했다_김예빈님이 들어왔습니다.
2022. 8. 16. 오후 5:00, 드로잉_권현준 : 평가기준이 red detection > blue detection > qr detection and land 인데요

 혹시 이륙전에 바닥 색깔로인해 이런색깔들이 미리 detection 되고 print를 하게되면 감점이 이루어지나요? 
2022. 8. 16. 오후 5:07, Staff_황태언 : 이륙 전이라면 takeoff 명령도 받기 전이기에 tello가 하얀색 벽을 바라보고 있을 것입니다. 그래서 색깔을 detection 할 이유도 없다고 판단됩니다.
2022. 8. 16. 오후 5:09, 드로잉_권현준 : 제가 해보니까 카메라 화각때문에 바닥이 찍히더라고요. 만약 대강당 나무 바닥에서 이륙한다면 red 컬러로 인식될 가능성이 있어보여서요 
2022. 8. 16. 오후 5:23, Staff_황태언 : takeoff 명령이 미션 시작을 알리는 것이기 때문에 이륙 전에 일어난 것에 대해서는 어떤 것도 인정이 되지 않습니다. 만일 이륙 전에 색이 print된다면 감점이 있진 않겠으나 심사자가 상시 옆에서 터미널 창을 감시하고 참가자 코드도 간단히 볼 이정이기에 미션 시작 전에 일어난 일에 대해서 점수는 절대 부가하지 않을 것입니다.
2022. 8. 16. 오후 8:44: 사드론_홍상권님이 들어왔습니다.
2022. 8. 16. 오후 9:38, 세얼간이_류새인 : 담당자님 1차 예선 시작이 몇시인지 알수있을까요?
2022. 8. 16. 오후 10:46: 록히드 야놀자_김정훈님이 들어왔습니다.
2022. 8. 16. 오후 11:44, 총괄팀장_김민유 : 1차 예선에 대한 공지는 이번주내로 정확하게 업로드해드리겠습니다. 

2022년 8월 17일 수요일
2022. 8. 17. 오전 11:00, 슈팅스타_유승섭 : AttributeError는 명령어가 다르면 나오는건가요?
2022. 8. 17. 오전 11:59: 록히드 야놀자_권현님이 들어왔습니다.
2022. 8. 17. 오후 12:55, 날아오르조_황주원 : 카톡방에서 최종코드를 수정하셨다고 하셨는데 개별적으로 함수를 추가해야하나요?
2022. 8. 17. 오후 1:45, Staff_황태언 : 명령어가 다르다는 게 무슨 의미인가요?
2022. 8. 17. 오후 1:46, 슈팅스타_유승섭 : tellopy.py에 입력 되어있지 않은 명령어를 입력하면 생기는 오류인 것 같아 해결하였습니다. 
2022. 8. 17. 오후 1:46, Staff_황태언 : 이 부분에 개인 이메일을 통해 답변드렸고, 혹여나 같은 오류를 겪고 계신 분들이 계실 것 같아 말씀드립니다. 새로 올린 매뉴얼에 마지막 코드가 mask 변수가 정의 돼있지 않다고 뜬다면 main 함수에 global mask를 한 번 입력 해보시길 바랍니다. 
2022. 8. 17. 오후 2:51, 초심자의코딩_김동환 : 빨간색이 인식되지 않은 상태에서 호버링이 있으면 감점요소가 되나요?
2022. 8. 17. 오후 3:39, Staff_강민주 : 미션 수행에 감점은 없습니다! 득점만 있는 대신 미션 수행이 끝나는 시간을 측정하여 순위를 매깁니다. 말씀하신 내용은 감점이 되지 않지만 미션 수행이 delay가 될테니 그부분에 불이익이 될 것 같습니다
2022. 8. 17. 오후 5:22, 드로잉_권현준 : 빨강 파랑 초록 rgb로 알려주셨는데요, 혹시 벽면에 실제로 붙는 종이는 일반 프린트로 출력이 되나요? 잉크젯 프린터로 뽑아보니까 색깔차이가 좀 많이나서요 
2022. 8. 17. 오후 5:24, Staff_황태언 : 연습실에 있었는데 못보셨을까요?
2022. 8. 17. 오후 5:25, 드로잉_권현준 : 아 아직 연습기간이아니라서요 

2022년 8월 19일 금요일
2022. 8. 19. 오전 11:46, 드로잉_권현준 : 혹시 연습실에 초록색 종이는 없을까요?
2022. 8. 19. 오후 2:17, staff_추세빈 : 410호에 있긴 한데 연습시간에 해당하는 방이 아니라면 판 자체를 옮기는 건 어려워서 가져와서 사용하면 좋을 것같아요!
2022. 8. 19. 오후 2:17, staff_추세빈 : 410>210
2022. 8. 19. 오후 2:21, staff_추세빈 : 초록색 종이 혹시 필요하신 분 질문방에 말하고 사용해주세요! 210호 책상 위에 올려두겠습니다 현재 214호에서 사용중ㅇ입니다.
2022. 8. 19. 오후 2:21, staff_추세빈 : 사용 후에는 210호 책상 위로 반납해주세요~
2022. 8. 19. 오후 2:38, 3 Lights_문광일 : 질문이 있습니다. 
1. detection 인정 부분에 대해서 궁금한것이 있는데, tello drone이 RGB 사각형을 detect하고  boundary와 centroid가 표시된 figure 창을 실시간으로 띄우면서 임무를 수행해도 득점으로 인정될까요?

2. 육각형 한개의 면에는 한개의 RGB or QR code 가 배치 되나요?(고도는 임의 설정 그대로)

3. RGB or QR code 의 배치는 육각형 한면의 정중앙에 배치 되도록 하나요? 또한 각각의 배치 범위를 알려 주셨는데 10x10 사이즈 원점 기준으로 측정된 고도를 기준으로 하는것이 맞나요?

4. 프린트의 기종 밑 잉크의 종류에 따라  RGB or QR code 의 색감이 조금씩 달라지는데, 지금 연습실에 세팅해 놓은 종이와 동일한 것을 대회에도 사용하나요? (동일한 프린터기 및 종이 등)
2022. 8. 19. 오후 2:50: 오키도키_정성식님이 들어왔습니다.
2022. 8. 19. 오후 3:20, Staff_황태언 : 1. 실시간으로 띄우면서 임무를 수행하더라도 detect 된 사진들을 임무 완료 후에 보이지 않는다면 득점으로 인정되지 않습니다.

2. 네 한 면에 하나씩 배치됩니다. 어느 면에 있을 지는 랜덤입니다. 

3. 육각형 중 한 명의 정중앙에 배치는 안될 수 있습니다. 배치 고도는 마커의 중심점 기준이 맞습니다.

4. 동일한 프린터기 사용 예정이며 종이도 동일한 것을 사용합니다. 또한 카메라는 조명에 따라 매우 달라집니다. 주어진 시간이 30분이기에 미션 도전 전에 잠깐 테스트하면 될 것 입니다.

2022. 8. 19. 오후 4:06, 시조새_장보현 : 1번 답변에서 detect 된 사각형을 따로 사진 이미지로 저장해서 출력해야한다는 뜻인가요? 아니면 미션중의 영상을 저장한거에 detect된 표시가 되어있으면 득점으로 인정이 된다는 의미인가요?  
2022. 8. 19. 오후 4:09, Staff_황태언 : 미션 중에 detect가 되면 영상을 저장할 것입니다. 그 저장된 이미지를 임무가 끝난 뒤 심사자가 보고 바운딩 박스 또는 센터 점이 찍혀있다고 판단하면 득점으로 인정됩니다.
2022. 8. 19. 오후 4:14, 시조새_장보현 : 미션 처음부터 끝까지 녹화된 것에서 detection이 표시되는지가 아니라. detection이 되는 순간부터 녹화가 시작되어서 detection이 끝나면 녹화가 끝나고 저장되어야한다는 의미인건가요? 
2022. 8. 19. 오후 4:15, Staff_황태언 : 미션 처음부터 끝까지 녹화될 필요는 없습니다. 그냥 detection된 사진 한 프레임만 저장하신 후에 보여주시면 됩니다
2022. 8. 19. 오후 4:15, 시조새_장보현 : 넵 알겠습니다 
2022. 8. 19. 오후 4:16: 록히도키_장지혁님이 들어왔습니다.
2022. 8. 19. 오후 4:33, 3 Lights_문광일 : 1. 그럼 이말은 임무가 끝났을 때, 해당 figure 창들이 전부 띄워져 있으면 상관 없다는 말씀이신가요?

4. 30분이라는 시간 동안 테스트 하는 시간은 미션 수행 시간으로 치지 않고 takeoff한 이후부터 미션수행시간으로 한다는 말씀이신가요?

2022. 8. 19. 오후 4:43, Staff_황태언 : 1. 임무가 끝난 후 두 개의 detection 사진을 화면에 띄워서 보여주시면 될 것 같습니다. 

4. takeoff한 이후부터 미션 수행은 30분이 나올 수 없습니다. (tello 배터리 시간이 그 정도 지속되지 않음.) 30분 안에 환경 파악과 미션 준비(여기서는 코드 수정 가능) 후에 실제로 미션 수행을 하겠다고 심사자에게 말씀 해주시면 심사에 들어갑니다. 미션 수행 하겠다고 하시면 코드 수정이 불가능하고 착륙시 바로 미션 종료입니다. 
2022. 8. 19. 오후 5:20, 3 Lights_문광일 : 4. 그럼 팀당 실 미션 수행 시간 + 테스트 및 점검 총 합쳐서 30분이 주어지고, 배터리는 여러개를 사용할 수 잇는건가요? 아니면 한개의 베터리로 위 과정을 전부 수행해야 하는건가요?
2022. 8. 19. 오후 5:21, Staff_강민주 : 배터리 필요한만큼 드리겠습니다

2022년 8월 20일 토요일
2022. 8. 20. 오전 10:54, 드로잉_권현준 : 1. 빨간색 detection되면 3초간 호버링후 고도 하강 미션에서 log상으로 고도가 하강했음을 보여주면되나요? 약간만 고도가 하강해도 되는지 궁금합니다. 

2.detection 된걸 캡처해야한다고 하셨는데 그냥 영상으로 캡처해서 그부분만 보여드리면 되는거죠? 캡처프로그램말고 핸드폰으로 영상촬영해서 보여드려도 될까요?

3. QR detection 후 랜딩하게되면 미션종료인가요? 랜딩후 프로그램을 종료 시킬 필욘 없는지 궁금합니다.
2022. 8. 20. 오전 11:01, Staff_황태언 : 1. 질문이 잘 이해가 안됩니다. takeoff 명령을 하면 약 120cm에서 호버링하게 되는데 빨간색 사각형은 약 70cm 높이에 있기 때문에 드론이 내려오면서 빨간색을 보면 그 자리에서 호버링을 의미합니다. 이는 눈으로 충분히 확인 가능합니다.

2. 핸드폰 영상 촬영은 안됩니다. 자체 내부 함수또는 캡처를 통해 사진을 저장한 후 미션 완료 후에 심사자에게 보여야 한다고 명시했습니다.

3. 랜딩이 미션 끝을 알리는 것입니다. 랜딩하면 프로그램을 종료하게끔 짜면 되는 것이지요.
2022. 8. 20. 오전 11:08, 드로잉_권현준 : “ 드론이륙 > 빨간색 사각형이 있는 고도에서 호버링(고도하강) “ 에서 고도하강이 이륙후 고도를 하강하라는 의미군요 오해했습니다. 
내부 함수말고 컴퓨터 캡처프로그램으로 영상캡처를 진행해도 무관한거죠?
2022. 8. 20. 오전 11:13, Staff_황태언 : 컴퓨터 캡처 도구로 사진 저장하는 것은 인정하지만 만일 detection 되더라도 타이밍을 놓쳐서 캡처를 하지 못한 경우는 그 미션에 대해 0점 처리합니다. 또한 캡처 도구 외 코드를 손대거나 하는 경우에는 전체 0점 처리하겠습니다.
2022. 8. 20. 오전 11:16, 드로잉_권현준 : 넵
2022. 8. 20. 오후 12:48: 날아라 드론보드_김병진님이 들어왔습니다.

"""

str = str[19230:]

if "중앙" in str:
    print("Found world")
    print(str.find('중앙'))

else:
    print("Not found world")
